---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSettings(Autodesk.Revit.DB.Document)
source: html/58e77947-e8ba-935c-d732-95c585dcc6cd.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSettings Method

Get the pipe settings of the project.

## Syntax (C#)
```csharp
public static PipeSettings GetPipeSettings(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The pipe settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null